# YOLOv12-turbo optimized for small objects

nc: 10
scales:
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 3, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 3, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]]      # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]   # 6
  - [-1, 1, Conv,  [1024, 3, 2]]     # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]  # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]        # P4
  - [-1, 3, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]        # P3
  - [-1, 3, A2C2f, [256, False, -1]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]        # P2
  - [-1, 3, C3k2, [128, False]]      # 17 (P2/4-smallest)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]       # P3
  - [-1, 2, A2C2f, [256, False, -1]] # 20

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]       # P4
  - [-1, 2, A2C2f, [512, False, -1]] # 23

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]        # P5
  - [-1, 2, C3k2, [1024, True]]      # 26 (P5/32)

  - [[17, 20, 23, 26], 1, Detect, [nc]]  # P2, P3, P4, P5