# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv11x object detection model with P2–P5 outputs (optimized for small objects)
# For usage see https://docs.ultralytics.com/tasks/detect

nc: 10  # number of classes

scales:
  x: [1.00, 1.50, 512]  # depth, width, max_channels

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [96, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [192, 3, 2]]      # 1-P2/4
  - [-1, 3, C3k2, [192, False, 0.25]] # 2
  - [-1, 1, Conv, [384, 3, 2]]      # 3-P3/8
  - [-1, 3, C3k2, [384, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]      # 6
  - [-1, 1, Conv, [768, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [768, True]]      # 8
  - [-1, 1, SPPF, [768, 5]]         # 9
  - [-1, 2, C2PSA, [768]]           # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # up -> P4
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]                    # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # up -> P3
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C3k2, [384, False]]                    # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # up -> P2
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C3k2, [192, False]]                    # 19 (P2/4-smallest)

  - [-1, 1, Conv, [192, 3, 2]]                     # down -> P3
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [384, False]]                    # 22 (P3/8-small)

  - [-1, 1, Conv, [384, 3, 2]]                     # down -> P4
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]                    # 25 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                     # down -> P5
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [768, True]]                     # 28 (P5/32-large)

  - [[19, 22, 25, 28], 1, YOLOEDetect, [nc, 256, True]]  # Detect(P2, P3, P4, P5)